/*Скласти програму, яка для введеного користувачем
цілого числа n друкує фігуру з n рядків, подібну до:

                          *
                         ***
                        *****
                       *******
                      *********
                Рівнобічний трикутник
*/

#include <stdio.h>

int main(){
  int n;

  scanf("%d", &n);

  for(int i = 1; i <= n; i++){
    for(int j = 1; j <= n + 1 - i; j++)
      printf(" ");
    for(int j = 0; j <= i * 2 - 2; j++)
      printf("*");
    printf("\n");
  }
  return 0;
}
