/*Пошук поділом навпіл*/

#include <stdio.h>

#define N 5
int write_array(int m[N]);
int sort_array(int m[N]);

int main(){
  int m[N], l = 0, r = N, k, x;

  write_array(m);
  sort_array(m);

  printf("Key?\n"); //ключ
  scanf("%d", &x);

/*-------------Навпіл----------------------------------------*/
  while (l < r) {        //Поки лічильник менший розміру масиву
    k = l + (r - l) / 2; //Формула поділу навпіл, така бо
                         //розрядна сітка може переповнитися

    if(m[k] == x)        //Якщо ключ знайдено в центрі масиву
      break;             //то вихід з циклу

    if(m[k] < x)         //Якщо поточний елемент менший ключа
      l = k + 1;         //то лічильник к(індекс масиву) + 1
                         //грубо кажучи перехід на праву сторону

    else r = k;          //Якщо ні то розмір масив = елементу
                         //і все ділиться наново
  }
  if(m[k] == x)          //Вивід ключа
    printf("%d\n", ++k);
  else
    printf("empty");
}
/*----------------------------------------------------------*/

int write_array(int m[N]){
  for(int i = 0; i < N; i++) {
    scanf("%d", &m[i]);
  }
}

int sort_array(int m[N]){
  int i = 0, t;

  while (i < N - 1) {
    if(m[i + 1] >= m[i])
      ++i;
    else{
      t = m[i];
      m[i] = m[i + 1];
      m[i + 1] = t;
      i = 0;
    }
  }
}
